# "EXAMPLES OF pandas MODULE"

# STARTING OF LECTURE-27:

### Serieses :-

In [20]:
# .Series() Fn.
# Example of series
import pandas as pd
import numpy as np
data=np.array(['a','b','c','d'])
s=pd.Series(data,index=[10,20,30,40])    # all indexes must be unique
print(s)

10    a
20    b
30    c
40    d
dtype: object

In [29]:
# indexing
print(s[20])
s[40]

b

'd'

In [40]:
# slicing
print(s[2:])
s[:3]

30    c
40    d
dtype: object

10    a
20    b
30    c
dtype: object

In [41]:
x=['a','b','c','d','e']
y=[1,2,3,4,5]
print(pd.Series(data=x,index=y),"\nOR")
s1=pd.Series(y,x)
print(s1)

1    a
2    b
3    c
4    d
5    e
dtype: object
OR
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [42]:
# indexing
print(s1['d'])
s1['a']

4

1

In [43]:
# slicing
print(s1['c':])
s1[:'d']

c    3
d    4
e    5
dtype: int64

a    1
b    2
c    3
d    4
dtype: int64

In [44]:
# it can make by using dictionary also
z={1:'a',2:'b',3:'c',4:'d'}
z1={'a':5,'b':6,'c':7,'d':8}
print(pd.Series(z),"\n")
s2=pd.Series(z1)
print(s2)

1    a
2    b
3    c
4    d
dtype: object

a    5
b    6
c    7
d    8
dtype: int64

In [17]:
# Addition of two series
# same indexes's value will add (and will convert to float values), and rest will show NaN
s1+s2

a     6.0
b     8.0
c    10.0
d    12.0
e     NaN
dtype: float64

###  DataFrames :-

In [107]:
# .DataFrame() Fn.
# example of dataframe
import pandas as pd
import numpy as np    # not need of this line
data=[1,2,3,4,5]
df1=pd.DataFrame(data)
print(df1,"\n")
index=[10,20,30,40,50]
df2=pd.DataFrame(data,index)
print(df2,"\n")
data2=[['Alex',10],['Bob',12],['Clarke',13]]
df3=pd.DataFrame(data2,index=['a','b','c'],columns=['Name','Age'])
print(df3)

   0
0  1
1  2
2  3
3  4
4  5

    0
10  1
20  2
30  3
40  4
50  5

     Name  Age
a    Alex   10
b     Bob   12
c  Clarke   13

In [17]:
# Creation of a dataframe using Dictionaries as data
#type1
import pandas as pd
data1={'Name':['Tom','Jack','Steve','Ricky'], 'Age':[20,22,24,28]}
df1=pd.DataFrame(data1)
print(df1,"\n")
#type2
data2=[{'a':1, 'b':2}, {'a':5, 'b':10, 'c':10}]
df2=pd.DataFrame(data2,index=[100,200])
print(df2)

    Name  Age
0    Tom   20
1   Jack   22
2  Steve   24
3  Ricky   28

     a   b     c
100  1   2   NaN
200  5  10  10.0

# STARTING OF LECTURE-28:

### Panels :-

In [18]:
# .Panel() Fn.
import pandas as pd 
data=[10,20,30]
p=pd.Panel(data)
print("it will not work because Panel class is removed from pandas as you can see a type error")
print(p)

<ipython-input-18-4e0ff1b62957>:4: FutureWarning: The Panel class is removed from pandas. Accessing it from the top-level namespace will also be removed in the next version
  p=pd.Panel(data)

TypeError: Panel() takes no arguments

######  Now we will continue with DataFrames :-

# using rawdata.csv file from now

In [58]:
# .read_csv
# MUST SEE the method that how we attach loction of file using --> r"location"
# Reading data from csv file
import pandas as pd
dfcsv=pd.read_csv(r"F:\DataScience\rawdata.csv")
print(dfcsv)

     Name hire date  salary  rest sick days
0   Sunny    21-Dec   50000              20
1    Shri    22-Dec   40000              15
2  Sushil    23-Dec   30000              10
3   vikas    24-Dec   20000               5

In [59]:
#continue with above eg.
print(dfcsv['salary'],"\n")    # reading the data from the column 'salary'
print(dfcsv['Name'])

0    50000
1    40000
2    30000
3    20000
Name: salary, dtype: int64

0     Sunny
1      Shri
2    Sushil
3     vikas
Name: Name, dtype: object

In [54]:
# continue with above eg
dfcsv[['salary']]

   salary
0   50000
1   40000
2   30000
3   20000

In [4]:
#contiue with above eg
dfcsv['rest sick days']    # reading the data from the column 'rest sick days'

0    20
1    15
2    10
3     5
Name: rest sick days, dtype: int64

In [62]:
#contiue with above eg
print(sum(dfcsv['rest sick days']))
sum(dfcsv['salary'])
#just like it, below also possible:

50

140000

In [5]:
#contiue with above eg
print(dfcsv[['Name','salary']])   # reading more than one column
dfcsv[['Name','salary']]

     Name  salary
0   Sunny   50000
1    Shri   40000
2  Sushil   30000
3   vikas   20000

     Name  salary
0   Sunny   50000
1    Shri   40000
2  Sushil   30000
3   vikas   20000

In [72]:
#contiue with above eg
# .sample() Method and shape,size,ndim Attribute of dataframe
print(dfcsv.sample(n=1))    # generating one random(not fix one) row
print(dfcsv.sample(n=2))    # generating two random(not fix one) row
print(dfcsv.shape)
print(dfcsv.size)
print(dfcsv.ndim)

   Name hire date  salary  rest sick days
1  Shri    22-Dec   40000              15
    Name hire date  salary  rest sick days
0  Sunny    21-Dec   50000              20
3  vikas    24-Dec   20000               5
(4, 4)
16
2

# Adding New columns in dataframe:

In [77]:
#contiue with above eg
#using 'ADDRESS' as the column name and equating it to the list
no_of_leaves = [4,5,6,7]
dfcsv['Leaves_taken']=no_of_leaves
# method 2nd is direct assignment as below:
dfcsv['Gender']=['m','m','m','f']
dfcsv

     Name hire date  salary  rest sick days  Leaves_taken Gender
0   Sunny    21-Dec   50000              20             4      m
1    Shri    22-Dec   40000              15             5      m
2  Sushil    23-Dec   30000              10             6      m
3   vikas    24-Dec   20000               5             7      f

# Deleting the particular coloumn from dataframe

In [84]:
#contiue with above eg
del dfcsv['rest sick days']
dfcsv

     Name hire date  salary  Leaves_taken Gender
0   Sunny    21-Dec   50000             4      m
1    Shri    22-Dec   40000             5      m
2  Sushil    23-Dec   30000             6      m
3   vikas    24-Dec   20000             7      f

In [85]:
#contiue with above eg
del dfcsv['Leaves_taken']
dfcsv

     Name hire date  salary Gender
0   Sunny    21-Dec   50000      m
1    Shri    22-Dec   40000      m
2  Sushil    23-Dec   30000      m
3   vikas    24-Dec   20000      f

#back to normal and continue with new csv file

# using Cricket.csv file from now

In [7]:
# total 4 over match
DF=pd.read_csv(r"F:\DataScience\Cricket.csv")
print(DF)

    Delivery  ind_score  pak_score
0        0.1          0          0
1        0.2          1          0
2        0.3          1          0
3        0.4          4          4
4        0.5          0          2
5        0.6          2          4
6        1.1          0          0
7        1.2          0          0
8        1.3          0          2
9        1.4          1          1
10       1.5          4          3
11       1.6          1          2
12       2.1          2          1
13       2.2          0          1
14       2.3          3          2
15       2.4          0          1
16       2.5          1          0
17       2.6          0          2
18       3.1          4          2
19       3.2          0          4
20       3.3          4          1
21       3.4          3          4
22       3.5          1          0
23       3.6          2          1

In [5]:
# continue with above eg == continue...
#instead of seeing all the data, we are going to use the ".head()" method to see first five(by default 5 is fix) rows/elements of the data
DF.head()

   Delivery  ind_score  pak_score
0       0.1          0          0
1       0.2          1          0
2       0.3          1          0
3       0.4          4          4
4       0.5          0          2

In [89]:
# continue...
# to read initial 10 rows
DF.head(10)

   Delivery  ind_score  pak_score
0       0.1          0          0
1       0.2          1          0
2       0.3          1          0
3       0.4          4          4
4       0.5          0          2
5       0.6          2          4
6       1.1          0          0
7       1.2          0          0
8       1.3          0          2
9       1.4          1          1

In [91]:
# continue...
# use of head() for partcular column
DF['Delivery'].head()

0    0.1
1    0.2
2    0.3
3    0.4
4    0.5
Name: Delivery, dtype: float64

In [88]:
# continue...
# Checking last 5(by defualt 5 is fix) elements/rows of the dataframe with ".tail()" method
DF.tail()

    Delivery  ind_score  pak_score
19       3.2          0          4
20       3.3          4          1
21       3.4          3          4
22       3.5          1          0
23       3.6          2          1

In [90]:
# continue...
# to read last 3 rows
DF.tail(3)

    Delivery  ind_score  pak_score
21       3.4          3          4
22       3.5          1          0
23       3.6          2          1

In [93]:
# continue...
# use of tail() for partcular column
DF['Delivery'].tail(7)

17    2.6
18    3.1
19    3.2
20    3.3
21    3.4
22    3.5
23    3.6
Name: Delivery, dtype: float64

# Sorting the DataFrame based on a column

In [12]:
# continue...
# .sort_values Method of dataframe
print(DF.sort_values('ind_score'))
DF.sort_values('pak_score', ascending=False)

    Delivery  ind_score  pak_score
0        0.1          0          0
19       3.2          0          4
17       2.6          0          2
4        0.5          0          2
15       2.4          0          1
6        1.1          0          0
7        1.2          0          0
8        1.3          0          2
13       2.2          0          1
16       2.5          1          0
22       3.5          1          0
11       1.6          1          2
9        1.4          1          1
2        0.3          1          0
1        0.2          1          0
12       2.1          2          1
5        0.6          2          4
23       3.6          2          1
14       2.3          3          2
21       3.4          3          4
3        0.4          4          4
18       3.1          4          2
20       3.3          4          1
10       1.5          4          3

    Delivery  ind_score  pak_score
21       3.4          3          4
3        0.4          4          4
5        0.6          2          4
19       3.2          0          4
10       1.5          4          3
14       2.3          3          2
4        0.5          0          2
8        1.3          0          2
18       3.1          4          2
11       1.6          1          2
17       2.6          0          2
12       2.1          2          1
20       3.3          4          1
15       2.4          0          1
23       3.6          2          1
13       2.2          0          1
9        1.4          1          1
16       2.5          1          0
1        0.2          1          0
7        1.2          0          0
6        1.1          0          0
2        0.3          1          0
22       3.5          1          0
0        0.1          0          0

In [15]:
# continue...
# .nunique Method
# count no. of unique values that occur in dataset or in a coloumn.
# in ind_score, there are five types of entries (0,1,2,3,4).
DF.nunique()

Delivery     24
ind_score     5
pak_score     5
dtype: int64

In [16]:
# continue...
print("India's score in starting four overs is =",sum(DF['ind_score']))
print("Pakistan's score in starting four overs is =",sum(DF['pak_score']))

India's score in starting four overs is = 34
Pakistan's score in starting four overs is = 37

# STARTING OF LECTURE-29:

# Indexing Using Labels in Pandas

Indexing can be worked with labels using the "panda.DataFrame.loc" method which allows to index using labels instead of positions. Using Loc, we can also slice the Pandas DataFrame over a range of indices.

In [17]:
# continue...
# .loc[] slicing
# Selecting rows from 1st to 4th.(note: Here 4th row is also included)
DF.loc[1:4]

   Delivery  ind_score  pak_score
1       0.2          1          0
2       0.3          1          0
3       0.4          4          4
4       0.5          0          2

In [19]:
# continue...
# prints fist five rows including 5th index and every column of DF.
DF.loc[0:5,:]

   Delivery  ind_score  pak_score
0       0.1          0          0
1       0.2          1          0
2       0.3          1          0
3       0.4          4          4
4       0.5          0          2
5       0.6          2          4

In [20]:
# continue...
# we had also seen many examples on slicing priviously for more pracyice checkout them.
# prints from 5th row onwards and entire columns of DF.
DF.loc[5:,:]

    Delivery  ind_score  pak_score
5        0.6          2          4
6        1.1          0          0
7        1.2          0          0
8        1.3          0          2
9        1.4          1          1
10       1.5          4          3
11       1.6          1          2
12       2.1          2          1
13       2.2          0          1
14       2.3          3          2
15       2.4          0          1
16       2.5          1          0
17       2.6          0          2
18       3.1          4          2
19       3.2          0          4
20       3.3          4          1
21       3.4          3          4
22       3.5          1          0
23       3.6          2          1

In [22]:
# continue...
# .describe()
# Computes various summary statistics
DF.describe()

        Delivery  ind_score  pak_score
count  24.000000  24.000000  24.000000
mean    1.850000   1.416667   1.541667
std     1.155328   1.501207   1.413573
min     0.100000   0.000000   0.000000
25%     0.975000   0.000000   0.000000
50%     1.850000   1.000000   1.000000
75%     2.725000   2.250000   2.000000
max     3.600000   4.000000   4.000000

# Filtering under one condition

In [25]:
# continue...
# select all rows with a condition
DF['ind_score'] >= 2

0     False
1     False
2     False
3      True
4     False
5      True
6     False
7     False
8     False
9     False
10     True
11    False
12     True
13    False
14     True
15    False
16    False
17    False
18     True
19    False
20     True
21     True
22    False
23     True
Name: ind_score, dtype: bool

In [34]:
# continue...
# DF[ CONDITION ]
# it gives the results according to the given ONE condition.
DF[ DF['ind_score'] >=2  ]

    Delivery  ind_score  pak_score
3        0.4          4          4
5        0.6          2          4
10       1.5          4          3
12       2.1          2          1
14       2.3          3          2
18       3.1          4          2
20       3.3          4          1
21       3.4          3          4
23       3.6          2          1

# Select rows with indices using "iloc"

When we are using iloc, we need to specify the rows  and coloumns by their integer index. If we want to select only the 1st and 3rd row, we simply need to put this into a list in the 'iloc' statement with our DataFrame.

In [42]:
# continue...
# .iloc[[row_indices list],[column_indices list]]
# not using colon(:) anywhere
# select rows with indexes
DF.iloc[[0,2, 12]]

    Delivery  ind_score  pak_score
0        0.1          0          0
2        0.3          1          0
12       2.1          2          1

In [40]:
# continue...
# select rows with particular indices and particular columns
DF.iloc[[2,4,5,6,9],[0,2]]

   Delivery  pak_score
2       0.3          0
4       0.5          2
5       0.6          4
6       1.1          0
9       1.4          1

# > FROM BOOTCAMP :

In [112]:
A=[1,2,3,4,5]
B=[6,7,8,9,10]
C=[11,12,13,14,15]
D=[16,17,18,19,20]
df=pd.DataFrame(data=[A,B,C,D],index=['a','b','c','d'],columns=['C1','C2','C3','C4','C5'])
# the order (data,index,column) is fix we cann;t change it.
print(df,'\n          OR')
df=pd.DataFrame([A,B,C,D],['a','b','c','d'],['C1','C2','C3','C4','C5'])
df

   C1  C2  C3  C4  C5
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
          OR

   C1  C2  C3  C4  C5
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20

In [113]:
# adding row
df.loc['e']={'C1':1,'C2':2,'C3':3,'C4':4,'C5':5}
df

   C1  C2  C3  C4  C5
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e   1   2   3   4   5

In [114]:
# adding column
# df['C6']=df['C1']+df['C2']
# del df['C6']
# or we can use below code for new column
df['C6']=[6,7,8,9,10]
df

   C1  C2  C3  C4  C5  C6
a   1   2   3   4   5   6
b   6   7   8   9  10   7
c  11  12  13  14  15   8
d  16  17  18  19  20   9
e   1   2   3   4   5  10

In [115]:
# deleting row
print(df.drop('e',inplace=False),"\n")
print(df)
# for permanent deleting
print(df.drop('e',inplace=True),"\n")
print(df)

   C1  C2  C3  C4  C5  C6
a   1   2   3   4   5   6
b   6   7   8   9  10   7
c  11  12  13  14  15   8
d  16  17  18  19  20   9

   C1  C2  C3  C4  C5  C6
a   1   2   3   4   5   6
b   6   7   8   9  10   7
c  11  12  13  14  15   8
d  16  17  18  19  20   9
e   1   2   3   4   5  10
None

   C1  C2  C3  C4  C5  C6
a   1   2   3   4   5   6
b   6   7   8   9  10   7
c  11  12  13  14  15   8
d  16  17  18  19  20   9

In [116]:
# deleting column
print(df.drop('C6',inplace=False,axis=1),"\n")
print(df)
# for permanent deleting
print(df.drop('C6',inplace=True,axis=1))
print(df)

   C1  C2  C3  C4  C5
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20

   C1  C2  C3  C4  C5  C6
a   1   2   3   4   5   6
b   6   7   8   9  10   7
c  11  12  13  14  15   8
d  16  17  18  19  20   9
None
   C1  C2  C3  C4  C5
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20

In [117]:
# access column
df['C1']

a     1
b     6
c    11
d    16
Name: C1, dtype: int64

In [118]:
# access row using label index
df.loc['b']

C1     6
C2     7
C3     8
C4     9
C5    10
Name: b, dtype: int64

In [119]:
# access row using default base index
df.iloc[0]

C1    1
C2    2
C3    3
C4    4
C5    5
Name: a, dtype: int64

In [121]:
# for elements greater than 3
df>3

      C1     C2     C3    C4    C5
a  False  False  False  True  True
b   True   True   True  True  True
c   True   True   True  True  True
d   True   True   True  True  True

In [125]:
df[df>3]

     C1    C2    C3  C4  C5
a   NaN   NaN   NaN   4   5
b   6.0   7.0   8.0   9  10
c  11.0  12.0  13.0  14  15
d  16.0  17.0  18.0  19  20

In [132]:
df[df['C1']>6]

   C1  C2  C3  C4  C5
c  11  12  13  14  15
d  16  17  18  19  20

In [133]:
df[df['C1']>6][['C2','C4']]

   C2  C4
c  12  14
d  17  19

Note: In case of multy conditions don't use 'and'/'or', but you can use '&'/'|' operators in condition statements.

#### Missing data :